# Basic SQL Queries by using SQLite Database Management System (DBMS) in JupyterLab

“SQLite is an in-process library that implements a self-contained, serverless, zero-configuration, transactional SQL database engine. The code for SQLite is in the public domain and is thus free for use for any purpose, commercial or private. SQLite is the most widely deployed database in the world with more applications than we can count, including several high-profile projects.“
Source: https://www.sqlite.org/about.html

- This study is prepared to show some basic SQL queries by using SQLite Database Management System (DBMS) in JupyterLab.

- In order to realize this study, firstly I installed SQLite. Then, with 8 sample tables (in csv format) I created a sample database called TrainingSQLiteDB in SQLite DB Browser. Lastly, I made necessary connection between my sample SQLite DB and JupyterLab. So I could start to run basic SQL queries like in JupyterLab.

##### Installation for connection and activation

In [1]:
%%!
pip install --trusted-host pypi.org ipython-sql

['Requirement already satisfied: ipython-sql in c:\\users\\camta\\anaconda3\\lib\\site-packages (0.4.0)',
 'Requirement already satisfied: prettytable<1 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython-sql) (0.7.2)',
 'Requirement already satisfied: sqlalchemy>=0.6.7 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython-sql) (1.4.7)',
 'Requirement already satisfied: sqlparse in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython-sql) (0.4.1)',
 'Requirement already satisfied: ipython-genutils>=0.1.0 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: ipython>=1.0 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython-sql) (7.22.0)',
 'Requirement already satisfied: six in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython-sql) (1.15.0)',
 'Requirement already satisfied: setuptools>=18.5 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (52.0.0.post20210125)',
 'Requirement already satisfied: decorator in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (5.0.6)',
 'Requirement already satisfied: jedi>=0.16 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.17.2)',
 'Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (3.0.17)',
 'Requirement already satisfied: traitlets>=4.2 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)',
 'Requirement already satisfied: backcall in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)',
 'Requirement already satisfied: pickleshare in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)',
 'Requirement already satisfied: pygments in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (2.8.1)',
 'Requirement already satisfied: colorama in c:\\users\\camta\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)',
 'Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.7.0)',
 'Requirement already satisfied: wcwidth in c:\\users\\camta\\anaconda3\\lib\\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)',
 'Requirement already satisfied: greenlet!=0.4.17 in c:\\users\\camta\\anaconda3\\lib\\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.0.0)']

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///TrainingSQLiteDB.db

### Basic SQL Queries

#### SELECT

In [4]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table'

 * sqlite:///TrainingSQLiteDB.db
Done.

[('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Products',),
 ('Shippers',),
 ('Suppliers',)]

In [5]:
%%sql
SELECT * FROM Customers LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [6]:
%%sql
SELECT CustomerName FROM Customers LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[('Alfreds Futterkiste',),
 ('Ana Trujillo Emparedados y helados',),
 ('Antonio Moreno Taquería',),
 ('Around the Horn',),
 ('Berglunds snabbköp',)]

In [7]:
%%sql
SELECT CustomerName, City FROM Customers LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[('Alfreds Futterkiste', 'Berlin'),
 ('Ana Trujillo Emparedados y helados', 'México D.F.'),
 ('Antonio Moreno Taquería', 'México D.F.'),
 ('Around the Horn', 'London'),
 ('Berglunds snabbköp', 'Luleå')]

In [8]:
%%sql
SELECT * FROM Products LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

In [9]:
%%sql
SELECT Price FROM Products LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(18,), (19,), (10,), (22,), (21,)]

##### SELECT + Some math operations

In [10]:
%%sql
SELECT Price, Price*2, Price*2-20 FROM Products LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(18, 36, 16), (19, 38, 18), (10, 20, 0), (22, 44, 24), (21, 42, 22)]

In [11]:
%%sql
SELECT Price as Price1, Price*2 as Price2, Price*2-20 as Price3 FROM Products LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(18, 36, 16), (19, 38, 18), (10, 20, 0), (22, 44, 24), (21, 42, 22)]

#### COUNT & ALIAS

In [12]:
%%sql
SELECT COUNT(*) FROM Customers

 * sqlite:///TrainingSQLiteDB.db
Done.

[(91,)]

In [13]:
%%sql
SELECT COUNT(*) FROM Orders

 * sqlite:///TrainingSQLiteDB.db
Done.

[(196,)]

In [14]:
%%sql
SELECT COUNT(*) FROM PRODUCTS

 * sqlite:///TrainingSQLiteDB.db
Done.

[(77,)]

In [15]:
%%sql
SELECT COUNT(*) AS Order_sample_size FROM ORDERS

 * sqlite:///TrainingSQLiteDB.db
Done.

[(196,)]

In [16]:
%%sql
SELECT COUNT(*) AS Product_sample_size FROM PRODUCTS

 * sqlite:///TrainingSQLiteDB.db
Done.

[(77,)]

#### ORDER BY & SORTING

In [17]:
%%sql
SELECT * FROM Products limit 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

In [18]:
%%sql
SELECT * FROM Products ORDER BY Price DESC LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(31, 'Gorgonzola Telino', 14, 4, '12 - 100 g pkgs', 435),
 (38, 'Côte de Blaye', 18, 1, '12 - 75 cl bottles', 263),
 (29, 'Thüringer Rostbratwurst', 12, 6, '50 bags x 30 sausgs.', 123),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (20, "Sir Rodney's Marmalade", 8, 3, '30 gift boxes', 81)]

#### DISTINCT

In [19]:
%%sql 
SELECT COUNT(CustomerID) FROM Orders

 * sqlite:///TrainingSQLiteDB.db
Done.

[(196,)]

In [20]:
%%sql 
SELECT COUNT(DISTINCT CustomerID) FROM Orders

 * sqlite:///TrainingSQLiteDB.db
Done.

[(74,)]

#### WHERE

In [21]:
%%sql
SELECT * FROM Shippers LIMIT 2

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Speedy Express', '(503) 555-9831'),
 (2, 'United Package', '(503) 555-3199')]

In [22]:
%%sql
SELECT * FROM Suppliers LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Exotic Liquid', 'Charlotte Cooper', '49 Gilbert St.', 'Londona', 'EC1 4SD', 'UK', '(171) 555-2222'),
 (2, 'New Orleans Cajun Delights', 'Shelley Burke', 'P.O. Box 78934', 'New Orleans', '70117', 'USA', '(100) 555-4822'),
 (3, "Grandma Kelly's Homestead", 'Regina Murphy', '707 Oxford Rd.', 'Ann Arbor', '48104', 'USA', '(313) 555-5735'),
 (4, 'Tokyo Traders', 'Yoshi Nagase', '9-8 Sekimai Musashino-shi', 'Tokyo', '100', 'Japan', '(03) 3555-5011'),
 (5, "Cooperativa de Quesos 'Las Cabras'", 'Antonio del Valle Saavedra', 'Calle del Rosal 4', 'Oviedo', '33007', 'Spain', '(98) 598 76 54')]

In [23]:
%%sql
SELECT * FROM Customers LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [24]:
%%sql
SELECT * FROM Customers WHERE Country = 'USA'

 * sqlite:///TrainingSQLiteDB.db
Done.

[(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA'),
 (43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA'),
 (45, "Let's Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA'),
 (48, 'Lonesome Pine Restaurant', 'Fran Wilson', '89 Chiaroscuro Rd.', 'Portland', '97219', 'USA'),
 (55, 'Old World Delicatessen', 'Rene Phillips', '2743 Bering St.', 'Anchorage', '99508', 'USA'),
 (65, 'Rattlesnake Canyon Grocery', 'Paula Wilson', '2817 Milton Dr.', 'Albuquerque', '87110', 'USA'),
 (71, 'Save-a-lot Markets', 'Jose Pavarotti', '187 Suffolk Ln.', 'Boise', '83720', 'USA'),
 (75, 'Split Rail Beer & Ale', 'Art Braunschweiger', 'P.O. Box 555', 'Lander', '82520', 'USA'),
 (77, 'The Big Cheese', 'Liz Nixon', '89 Jefferson Way Suite 2', 'Portland', '97201', 'USA'),
 (78, 'The Cracker Box', 'Liu Wong', '55 Grizzly Peak Rd.', 'Butte', '59801', 'USA'),
 (82, "Trail's Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA'),
 (89, 'White Clover Markets', 'Karl Jablonski', '305 - 14th Ave. S. Suite 3B', 'Seattle', '98128', 'USA')]

In [25]:
%%sql
SELECT * FROM Suppliers WHERE Country = 'Japan'

 * sqlite:///TrainingSQLiteDB.db
Done.

[(4, 'Tokyo Traders', 'Yoshi Nagase', '9-8 Sekimai Musashino-shi', 'Tokyo', '100', 'Japan', '(03) 3555-5011'),
 (6, "Mayumi's", 'Mayumi Ohno', '92 Setsuko Chuo-ku', 'Osaka', '545', 'Japan', '(06) 431-7877')]

In [26]:
%%sql
SELECT * FROM Customers WHERE NOT Country = 'UK' LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')]

In [27]:
%%sql 
SELECT * FROM Customers WHERE CustomerID = 54

 * sqlite:///TrainingSQLiteDB.db
Done.

[(54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina')]

In [28]:
%%sql
SELECT * FROM Customers WHERE CustomerID > 54

 * sqlite:///TrainingSQLiteDB.db
Done.

[(55, 'Old World Delicatessen', 'Rene Phillips', '2743 Bering St.', 'Anchorage', '99508', 'USA'),
 (56, 'Ottilies Käseladen', 'Henriette Pfalzheim', 'Mehrheimerstr. 369', 'Köln', '50739', 'Germany'),
 (57, 'Paris spécialités', 'Marie Bertrand', '265, boulevard Charonne', 'Paris', '75012', 'France'),
 (58, 'Pericles Comidas clásicas', 'Guillermo Fernández', 'Calle Dr. Jorge Cash 321', 'México D.F.', '5033', 'Mexico'),
 (59, 'Piccolo und mehr', 'Georg Pipps', 'Geislweg 14', 'Salzburg', '5020', 'Austria'),
 (60, 'Princesa Isabel Vinhoss', 'Isabel de Castro', 'Estrada da saúde n. 58', 'Lisboa', '1756', 'Portugal'),
 (61, 'Que Delícia', 'Bernardo Batista', 'Rua da Panificadora, 12', 'Rio de Janeiro', '02389-673', 'Brazil'),
 (62, 'Queen Cozinha', 'Lúcia Carvalho', 'Alameda dos Canàrios, 891', 'São Paulo', '05487-020', 'Brazil'),
 (63, 'QUICK-Stop', 'Horst Kloss', 'Taucherstraße 10', 'Cunewalde', '1307', 'Germany'),
 (64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', '1010', 'Argentina'),
 (65, 'Rattlesnake Canyon Grocery', 'Paula Wilson', '2817 Milton Dr.', 'Albuquerque', '87110', 'USA'),
 (66, 'Reggiani Caseifici', 'Maurizio Moroni', 'Strada Provinciale 124', 'Reggio Emilia', '42100', 'Italy'),
 (67, 'Ricardo Adocicados', 'Janete Limeira', 'Av. Copacabana, 267', 'Rio de Janeiro', '02389-890', 'Brazil'),
 (68, 'Richter Supermarkt', 'Michael Holz', 'Grenzacherweg 237', 'Genève', '1203', 'Switzerland'),
 (69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain'),
 (70, 'Santé Gourmet', 'Jonas Bergulfsen', 'Erling Skakkes gate 78', 'Stavern', '4110', 'Norway'),
 (71, 'Save-a-lot Markets', 'Jose Pavarotti', '187 Suffolk Ln.', 'Boise', '83720', 'USA'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK'),
 (73, 'Simons bistro', 'Jytte Petersen', 'Vinbæltet 34', 'København', '1734', 'Denmark'),
 (74, 'Spécialités du monde', 'Dominique Perrier', '25, rue Lauriston', 'Paris', '75016', 'France'),
 (75, 'Split Rail Beer & Ale', 'Art Braunschweiger', 'P.O. Box 555', 'Lander', '82520', 'USA'),
 (76, 'Suprêmes délices', 'Pascale Cartrain', 'Boulevard Tirou, 255', 'Charleroi', 'B-6000', 'Belgium'),
 (77, 'The Big Cheese', 'Liz Nixon', '89 Jefferson Way Suite 2', 'Portland', '97201', 'USA'),
 (78, 'The Cracker Box', 'Liu Wong', '55 Grizzly Peak Rd.', 'Butte', '59801', 'USA'),
 (79, 'Toms Spezialitäten', 'Karin Josephs', 'Luisenstr. 48', 'Münster', '44087', 'Germany'),
 (80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico'),
 (81, 'Tradição Hipermercados', 'Anabela Domingues', 'Av. Inês de Castro, 414', 'São Paulo', '05634-030', 'Brazil'),
 (82, "Trail's Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA'),
 (83, 'Vaffeljernet', 'Palle Ibsen', 'Smagsløget 45', 'Århus', '8200', 'Denmark'),
 (84, 'Victuailles en stock', 'Mary Saveley', '2, rue du Commerce', 'Lyon', '69004', 'France'),
 (85, 'Vins et alcools Chevalier', 'Paul Henriot', "59 rue de l'Abbaye", 'Reims', '51100', 'France'),
 (86, 'Die Wandernde Kuh', 'Rita Müller', 'Adenauerallee 900', 'Stuttgart', '70563', 'Germany'),
 (87, 'Wartian Herkku', 'Pirkko Koskitalo', 'Torikatu 38', 'Oulu', '90110', 'Finland'),
 (88, 'Wellington Importadora', 'Paula Parente', 'Rua do Mercado, 12', 'Resende', '08737-363', 'Brazil'),
 (89, 'White Clover Markets', 'Karl Jablonski', '305 - 14th Ave. S. Suite 3B', 'Seattle', '98128', 'USA'),
 (90, 'Wilman Kala', 'Matti Karttunen', 'Keskuskatu 45', 'Helsinki', '21240', 'Finland'),
 (91, 'Wolski', 'Zbyszek', 'ul. Filtrowa 68', 'Walla', '01-012', 'Poland')]

In [29]:
%%sql
SELECT * FROM Customers WHERE CustomerID > 28 AND CustomerID < 35

 * sqlite:///TrainingSQLiteDB.db
Done.

[(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain'),
 (30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (33, 'GROSELLA-Restaurante', 'Manuel Pereira', '5ª Ave. Los Palos Grandes', 'Caracas', '1081', 'Venezuela'),
 (34, 'Hanari Carnes', 'Mario Pontes', 'Rua do Paço, 67', 'Rio de Janeiro', '05454-876', 'Brazil')]

In [30]:
%%sql
SELECT * FROM Customers WHERE Country = 'UK' AND City = 'London'

 * sqlite:///TrainingSQLiteDB.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK')]

In [31]:
%%sql
SELECT * FROM Customers WHERE Country = 'USA' AND City = 'Eugene'

 * sqlite:///TrainingSQLiteDB.db
Done.

[(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA')]

In [32]:
%%sql
SELECT * FROM Customers WHERE Country = 'USA' AND (City = 'Eugene' OR City = 'Elgin');

 * sqlite:///TrainingSQLiteDB.db
Done.

[(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA')]

In [33]:
# OR ile yaptigimiz yukaridaki islemei IN ile de yapabiliriz

In [34]:
%%sql
SELECT * FROM Customers WHERE Country = 'USA' AND City IN ('Eugene', 'Elgin')

 * sqlite:///TrainingSQLiteDB.db
Done.

[(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA')]

In [35]:
%%sql
SELECT * FROM Customers WHERE CustomerID in (1,22,3,45)

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain'),
 (45, "Let's Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA')]

In [36]:
%%sql
SELECT * FROM Customers WHERE CustomerID in (5,18,53)

 * sqlite:///TrainingSQLiteDB.db
Done.

[(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (18, 'Du monde entier', 'Janine Labrune', '67, rue des Cinquante Otages', 'Nantes', '44000', 'France'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK')]

#### LIKE

In [37]:
%%sql
SELECT * FROM Customers LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [38]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE '%as%' LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain'),
 (12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', '1010', 'Argentina'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain'),
 (29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')]

In [39]:
%%sql
SELECT * FROM Customers WHERE CustomerName LIKE '%i' LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(49, 'Magazzini Alimentari Riuniti', 'Giovanni Rovelli', 'Via Ludovico il Moro 22', 'Bergamo', '24100', 'Italy'),
 (66, 'Reggiani Caseifici', 'Maurizio Moroni', 'Strada Provinciale 124', 'Reggio Emilia', '42100', 'Italy'),
 (91, 'Wolski', 'Zbyszek', 'ul. Filtrowa 68', 'Walla', '01-012', 'Poland')]

In [40]:
%%sql
SELECT *FROM Customers WHERE CustomerName LIKE 'T%' AND Country LIKE '%a' LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(77, 'The Big Cheese', 'Liz Nixon', '89 Jefferson Way Suite 2', 'Portland', '97201', 'USA'),
 (78, 'The Cracker Box', 'Liu Wong', '55 Grizzly Peak Rd.', 'Butte', '59801', 'USA'),
 (82, "Trail's Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA')]

#### BETWEEN

In [41]:
%%sql
SELECT * FROM Products LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

In [42]:
%%sql
SELECT * from Products WHERE Price BETWEEN 16 AND 35 LIMIT 10

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31),
 (11, 'Queso Cabrales', 5, 4, '1 kg pkg.', 21),
 (14, 'Tofu', 6, 7, '40 - 100 g pkgs.', 23),
 (16, 'Pavlova', 7, 3, '32 - 500 g boxes', 17)]

In [43]:
%%sql
SELECT * FROM Products WHERE (Price BETWEEN 16 AND 35) AND NOT CategoryID IN (1,2) LIMIT 10

 * sqlite:///TrainingSQLiteDB.db
Done.

[(7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31),
 (11, 'Queso Cabrales', 5, 4, '1 kg pkg.', 21),
 (14, 'Tofu', 6, 7, '40 - 100 g pkgs.', 23),
 (16, 'Pavlova', 7, 3, '32 - 500 g boxes', 17),
 (22, "Gustaf's Knäckebröd", 9, 5, '24 - 500 g pkgs.', 21),
 (26, 'Gumbär Gummibärchen', 11, 3, '100 - 250 g bags', 31),
 (30, 'Nord-Ost Matjeshering', 13, 8, '10 - 200 g glasses', 25),
 (32, 'Mascarpone Fabioli', 14, 4, '24 - 200 g pkgs.', 32),
 (36, 'Inlagd Sill', 17, 8, '24 - 250 g jars', 19)]

In [44]:
%%sql 
SELECT * FROM Products WHERE (Price BETWEEN 16 AND 35) AND NOT CategoryID IN (1,2,7,8)

 * sqlite:///TrainingSQLiteDB.db
Done.

[(11, 'Queso Cabrales', 5, 4, '1 kg pkg.', 21),
 (16, 'Pavlova', 7, 3, '32 - 500 g boxes', 17),
 (22, "Gustaf's Knäckebröd", 9, 5, '24 - 500 g pkgs.', 21),
 (26, 'Gumbär Gummibärchen', 11, 3, '100 - 250 g bags', 31),
 (32, 'Mascarpone Fabioli', 14, 4, '24 - 200 g pkgs.', 32),
 (48, 'Chocolade', 22, 3, '10 pkgs.', 27),
 (49, 'Maxilaku', 23, 3, '24 - 50 g pkgs.', 20),
 (50, 'Valkoinen suklaa', 23, 3, '12 - 100 g bars', 16),
 (53, 'Perth Pasties', 24, 6, '48 pieces', 32),
 (54, 'Tourtière', 25, 6, '16 pies', 16),
 (55, 'Pâté chinois', 25, 6, '24 boxes x 2 pies', 24),
 (60, 'Camembert Pierrot', 28, 4, '15 - 300 g rounds', 34),
 (64, 'Wimmers gute Semmelknödel', 12, 5, '20 bags x 4 pieces', 33),
 (71, 'Fløtemysost', 15, 4, '10 - 500 g pkgs.', 21),
 (72, 'Mozzarella di Giovanni', 14, 4, '24 - 200 g pkgs.', 34)]

In [45]:
%%sql 
SELECT * FROM Products WHERE (Price BETWEEN 16 AND 35) AND CategoryID IN (1,2,7,8)

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31),
 (14, 'Tofu', 6, 7, '40 - 100 g pkgs.', 23),
 (30, 'Nord-Ost Matjeshering', 13, 8, '10 - 200 g glasses', 25),
 (35, 'Steeleye Stout', 16, 1, '24 - 12 oz bottles', 18),
 (36, 'Inlagd Sill', 17, 8, '24 - 250 g jars', 19),
 (37, 'Gravad lax', 17, 8, '12 - 500 g pkgs.', 26),
 (39, 'Chartreuse verte', 18, 1, '750 cc per bottle', 18),
 (41, "Jack's New England Clam Chowder", 19, 8, '12 - 12 oz cans', 23),
 (44, 'Gula Malacca', 20, 2, '20 - 2 kg bags', 19),
 (66, 'Louisiana Hot Spiced Okra', 2, 2, '24 - 8 oz jars', 17),
 (75, 'Rhönbräu Klosterbier', 12, 1, '24 - 0.5 l bottles', 27),
 (76, 'Lakkalikööri', 23, 1, '500 ml', 18)]

#### Aggregation Functions

In [46]:
%%sql 
SELECT * FROM Products LIMIT 15

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31),
 (11, 'Queso Cabrales', 5, 4, '1 kg pkg.', 21),
 (12, 'Queso Manchego La Pastora', 5, 4, '10 - 500 g pkgs.', 38),
 (13, 'Konbu', 6, 8, '2 kg box', 6),
 (14, 'Tofu', 6, 7, '40 - 100 g pkgs.', 23),
 (15, 'Genen Shouyu', 6, 2, '24 - 250 ml bottles', 43)]

In [47]:
%%sql
SELECT *from Products limit 10

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31)]

In [48]:
%%sql
SELECT MAX(Price) FROM Products

 * sqlite:///TrainingSQLiteDB.db
Done.

[(435,)]

In [49]:
%%sql
SELECT MIN(Price) FROM Products

 * sqlite:///TrainingSQLiteDB.db
Done.

[(6,)]

In [50]:
%%sql
SELECT MIN(Price), MAX(Price) FROM Products

 * sqlite:///TrainingSQLiteDB.db
Done.

[(6, 435)]

In [51]:
%%sql
SELECT MIN(Price), MAX(Price) from Products;

 * sqlite:///TrainingSQLiteDB.db
Done.

[(6, 435)]

In [52]:
%%sql
SELECT AVG(price), MIN(Price), MAX(Price) FROM Products

 * sqlite:///TrainingSQLiteDB.db
Done.

[(39.15584415584416, 6, 435)]

In [53]:
%%sql
SELECT SUM(Price), AVG(Price), MIN(Price), MAX(Price) from Products

 * sqlite:///TrainingSQLiteDB.db
Done.

[(3015, 39.15584415584416, 6, 435)]

In [54]:
%%sql
SELECT SUM(Price), AVG(Price), MIN(Price), MAX(Price) FROM Products

 * sqlite:///TrainingSQLiteDB.db
Done.

[(3015, 39.15584415584416, 6, 435)]

In [55]:
%%sql
SELECT SUM(Price) AS sum_price, AVG(Price) AS avg_price, MIN(Price) AS min_price, MAX(Price) AS max_price FROM Products

 * sqlite:///TrainingSQLiteDB.db
Done.

[(3015, 39.15584415584416, 6, 435)]

#### GROUP BY

In [56]:
%%sql
SELECT COUNT(CustomerID) AS NumberofCustomer, Country FROM Customers GROUP BY Country

 * sqlite:///TrainingSQLiteDB.db
Done.

[(3, 'Argentina'),
 (2, 'Austria'),
 (2, 'Belgium'),
 (9, 'Brazil'),
 (3, 'Canada'),
 (2, 'Denmark'),
 (2, 'Finland'),
 (11, 'France'),
 (11, 'Germany'),
 (1, 'Ireland'),
 (3, 'Italy'),
 (5, 'Mexico'),
 (1, 'Norway'),
 (1, 'Poland'),
 (2, 'Portugal'),
 (5, 'Spain'),
 (2, 'Sweden'),
 (2, 'Switzerland'),
 (7, 'UK'),
 (13, 'USA'),
 (4, 'Venezuela')]

In [57]:
%%sql
SELECT COUNT(CustomerID) AS NumberofCustomer, Country FROM Customers GROUP BY Country ORDER BY NumberofCustomer DESC

 * sqlite:///TrainingSQLiteDB.db
Done.

[(13, 'USA'),
 (11, 'Germany'),
 (11, 'France'),
 (9, 'Brazil'),
 (7, 'UK'),
 (5, 'Spain'),
 (5, 'Mexico'),
 (4, 'Venezuela'),
 (3, 'Italy'),
 (3, 'Canada'),
 (3, 'Argentina'),
 (2, 'Switzerland'),
 (2, 'Sweden'),
 (2, 'Portugal'),
 (2, 'Finland'),
 (2, 'Denmark'),
 (2, 'Belgium'),
 (2, 'Austria'),
 (1, 'Poland'),
 (1, 'Norway'),
 (1, 'Ireland')]

In [58]:
%%sql
SELECT COUNT(CustomerID) AS NumberofCustomer, Country FROM Customers GROUP BY Country ORDER BY NumberofCustomer

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Ireland'),
 (1, 'Norway'),
 (1, 'Poland'),
 (2, 'Austria'),
 (2, 'Belgium'),
 (2, 'Denmark'),
 (2, 'Finland'),
 (2, 'Portugal'),
 (2, 'Sweden'),
 (2, 'Switzerland'),
 (3, 'Argentina'),
 (3, 'Canada'),
 (3, 'Italy'),
 (4, 'Venezuela'),
 (5, 'Mexico'),
 (5, 'Spain'),
 (7, 'UK'),
 (9, 'Brazil'),
 (11, 'France'),
 (11, 'Germany'),
 (13, 'USA')]

In [59]:
%%sql
SELECT COUNT(CustomerID) as MUSTERI_SAYISI, Country FROM Customers GROUP BY Country ORDER BY MUSTERI_SAYISI DESC;

 * sqlite:///TrainingSQLiteDB.db
Done.

[(13, 'USA'),
 (11, 'Germany'),
 (11, 'France'),
 (9, 'Brazil'),
 (7, 'UK'),
 (5, 'Spain'),
 (5, 'Mexico'),
 (4, 'Venezuela'),
 (3, 'Italy'),
 (3, 'Canada'),
 (3, 'Argentina'),
 (2, 'Switzerland'),
 (2, 'Sweden'),
 (2, 'Portugal'),
 (2, 'Finland'),
 (2, 'Denmark'),
 (2, 'Belgium'),
 (2, 'Austria'),
 (1, 'Poland'),
 (1, 'Norway'),
 (1, 'Ireland')]

In [60]:
%%sql
SELECT * FROM Products LIMIT 15

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31),
 (11, 'Queso Cabrales', 5, 4, '1 kg pkg.', 21),
 (12, 'Queso Manchego La Pastora', 5, 4, '10 - 500 g pkgs.', 38),
 (13, 'Konbu', 6, 8, '2 kg box', 6),
 (14, 'Tofu', 6, 7, '40 - 100 g pkgs.', 23),
 (15, 'Genen Shouyu', 6, 2, '24 - 250 ml bottles', 43)]

In [61]:
%%sql
SELECT AVG(Price) AS Avg_price, CategoryID FROM Products GROUP BY CategoryID

 * sqlite:///TrainingSQLiteDB.db
Done.

[(42.75, 1),
 (28.25, 2),
 (33.76923076923077, 3),
 (74.9, 4),
 (23.571428571428573, 5),
 (55.166666666666664, 6),
 (32.2, 7),
 (26.5, 8)]

In [62]:
%%sql
SELECT AVG(Price) AS Avg_price, CategoryID FROM Products GROUP BY CategoryID ORDER BY Avg_price DESC

 * sqlite:///TrainingSQLiteDB.db
Done.

[(74.9, 4),
 (55.166666666666664, 6),
 (42.75, 1),
 (33.76923076923077, 3),
 (32.2, 7),
 (28.25, 2),
 (26.5, 8),
 (23.571428571428573, 5)]

In [63]:
%%sql
SELECT AVG(Price) AS Avg_price, CategoryID FROM Products GROUP BY CategoryID ORDER BY Avg_price

 * sqlite:///TrainingSQLiteDB.db
Done.

[(23.571428571428573, 5),
 (26.5, 8),
 (28.25, 2),
 (32.2, 7),
 (33.76923076923077, 3),
 (42.75, 1),
 (55.166666666666664, 6),
 (74.9, 4)]

In [64]:
%%sql
SELECT * FROM Categories LIMIT 10

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads'),
 (4, 'Dairy Products', 'Cheeses'),
 (5, 'Grains/Cereals', 'Breads, crackers, pasta, and cereal'),
 (6, 'Meat/Poultry', 'Prepared meats'),
 (7, 'Produce', 'Dried fruit and bean curd'),
 (8, 'Seafood', 'Seaweed and fish')]

#### JOIN (LEFT & INNER)

In [65]:
%%sql
SELECT * FROM Categories LIMIT 10

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads'),
 (4, 'Dairy Products', 'Cheeses'),
 (5, 'Grains/Cereals', 'Breads, crackers, pasta, and cereal'),
 (6, 'Meat/Poultry', 'Prepared meats'),
 (7, 'Produce', 'Dried fruit and bean curd'),
 (8, 'Seafood', 'Seaweed and fish')]

In [66]:
%%sql
SELECT * FROM Products LIMIT 10

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31)]

In [67]:
%%sql
SELECT * FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 10

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30, 7, 'Produce', 'Dried fruit and bean curd'),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40, 2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97, 6, 'Meat/Poultry', 'Prepared meats'),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31, 8, 'Seafood', 'Seaweed and fish')]

In [68]:
%%sql
SELECT Products.ProductName, Products.CategoryID, Categories.CategoryName FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 10

 * sqlite:///TrainingSQLiteDB.db
Done.

[('Chais', 1, 'Beverages'),
 ('Chang', 1, 'Beverages'),
 ('Aniseed Syrup', 2, 'Condiments'),
 ("Chef Anton's Cajun Seasoning", 2, 'Condiments'),
 ("Chef Anton's Gumbo Mix", 2, 'Condiments'),
 ("Grandma's Boysenberry Spread", 2, 'Condiments'),
 ("Uncle Bob's Organic Dried Pears", 7, 'Produce'),
 ('Northwoods Cranberry Sauce', 2, 'Condiments'),
 ('Mishi Kobe Niku', 6, 'Meat/Poultry'),
 ('Ikura', 8, 'Seafood')]

In [69]:
%%sql
SELECT * from Customers limit 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [70]:
%%sql
SELECT * FROM ORDERS LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2),
 (10251, 84, 3, '8.07.1996', 1),
 (10252, 76, 4, '9.07.1996', 2)]

In [71]:
%%sql
SELECT Orders.OrderID, Customers.CustomerName FROM Orders INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID LIMIT 5

 * sqlite:///TrainingSQLiteDB.db
Done.

[(10248, 'Wilman Kala'),
 (10249, 'Tradição Hipermercados'),
 (10250, 'Hanari Carnes'),
 (10251, 'Victuailles en stock'),
 (10252, 'Suprêmes délices')]